     fsalarie   iF   E           K Disk

     C                   do        *hival
     C                   read      salarie
     C                   if        %eof
     C                   leave
     C                   end
     C     nom           dsply
     C                   enddo
     C                   eval      *inlr = '1'
      * AAA
